modules/Space/Models/Space.php

    public function isAvailableInRanges($start_date,$end_date){

        $days = max(1,floor((strtotime($end_date) - strtotime($start_date)) / DAY_IN_SECONDS));

        if($this->getBookingType() == 'by_night'){
            $end_date  = date("Y-m-d 23:59:59",strtotime($end_date." -1day"));
        }

        if($this->default_state)
        {
            $notAvailableDates = $this->spaceDateClass::query()->where([
                ['start_date','>=',$start_date],
                ['end_date','<=',$end_date],
                ['active','0'],
                ['target_id','=',$this->id],
            ])->count('id');
            if($notAvailableDates) return false;

        }else{
            $availableDates = $this->spaceDateClass::query()->where([
                ['start_date','>=',$start_date],
                ['end_date','<=',$end_date],
                ['active','=',1],
                ['target_id','=',$this->id],
            ])->count('id');
---
select count(`id`) as aggregate from `bravo_space_dates` where (`start_date` >= '2024-07-06' and `end_date` <= '2024-07-06' and `active` = '0' and `target_id` = 12)
select count(`id`) as aggregate from `bravo_space_dates` where (`start_date` >= '2024-12-02' and `end_date` <= '2024-12-14' and `active` = '0' and `target_id` = 134)