modules/Review/Models/Review.php

select * from `bravo_review_meta` where `review_id` = 267 and `name` = 'upload_picture' limit 1
---
    public function getReviewMetaPicture()
    {
        return ReviewMeta::where("review_id", $this->id)->where('name', 'upload_picture')->first();