modules/Tour/Models/TourCategory.php

select `id`, `name` from `bravo_tour_category` where `bravo_tour_category`.`deleted_at` is null order by `id` desc limit 10
---
    public static function searchForMenu($q = false)
    {
        $query = static::select('id', 'name');
        if (strlen($q)) {
            $query->where('name', 'like', "%" . $q . "%");
        }
        $a = $query->orderBy('id', 'desc')->limit(10)->get();