app/User.php

select * from `user_meta` where (`user_id` is null and `name` = 'social_meta_avatar') limit 1
---
        public function getMeta($key, $default = '')
        {
            //if(isset($this->cachedMeta[$key])) return $this->cachedMeta[$key];

            $val = DB::table('user_meta')->where([
                'user_id' => $this->id,
                'name'    => $key
            ])->first();

select count(`id`) as aggregate from `ch_messages` where `to_id` = 1 and `from_id` != 1 and `seen` = 0
---
        public function getUnseenMessageCountAttribute(){
            return Message::query()->where('to_id',$this->id)->where('from_id','!=',$this->id)->where('seen',0)->count(['id']);