modules/Core/Models/Settings.php

select * from `core_settings` group by `name`
---
    public static function getSettings($group = '',$locale = '')
    {
        if ($group) {
            static::where('group', $group);
        }
        $all = static::groupBy('name')->get();

select * from `core_settings` where `name` = 'home_page_id' limit 1
---
    public static function item($item, $default = false)
    {
        if($item == 'wallet_module_disable'){
            return true;
        }
        $value = Cache::rememberForever('setting_' . $item, function () use ($item ,$default) {
            $val = Settings::where('name', $item)->first();